---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalSpace
source: html/c0998e34-4230-ea28-dca3-649ff1b6518f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalSpace Property

"Analytical Space"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalSpace { get; }
```